# Why Pandas?
The Pandas python library has been a staple to Data Engineering. With pandas, we are able to transform data using traditional Data Science techniques and programming techniques native to python data structures.

## Table of Contents
- [Read Table](#read_table)
- [Series](#series)
- [Indexing and Selecting Data](#indexing-and-selecting-data)
   - [Bracket Notation](#brackets--)
      - [Pandas Options](#options-to-set-when-using-bracket-notation)
   - [Attribute Notation](#attribute-notation-)
- [Methods and Attributes of Pandas](#methods-and-attributes-of-pandas)
- [Columnar Transformations](#columnar-transformations)

## Read_Table
The file we use for the call to `read_table` is set up in a way to work with the default parameters. Namely, the file uses tabs as the delimiter and the first row of data in the file is inferred as the header for the entire dataset.

In [31]:
from pandas import read_table

In [3]:
# read a dataset of Chipotle orders from a URL and store the result in a DataFrame
orders = read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv')

In [4]:
# examine the first n rows of the given DataFrame, defaults to 5 if no value is given for n
orders.head(8)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75

For the next dataframe, we will be working with a dataset that is not perfectly suited to the default call of `read_table`. In this case, the data is a `raw text file` with no headers and an uncommon delimiter. We will need to add parameters to handle these cases and define the columns for the dataframe.

In [5]:
user_columns = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

users = read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user',
                      sep='|', header=None, names=user_columns)

users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## Series
In this section, we will focus on two of the three main object types seen in pandas: DataFrame and Series. Previously, we used `read_table` to create the basic DataFrame object. Now, we'll use python's native attribute retrieval notations to manipulate the data in the DataFrame by column. This resulting column object is known as a Series.

In [32]:
from pandas import read_csv

In [78]:
# Create a DataFrame from a csv file using the previous read_table
# ufo = pd.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv', sep=',')
# OR
ufo = read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')


# Returns the first Index or row item of the DataFrame which will hold the column names if they are defined
print(ufo.columns)

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Calling the `head` function on the `ufo` dataframe allows us to peak at the data contained in the table. For now, we're only interested in learning the values of the columns so instead we can call `print` on the ufo columns attribute instead. In the following code snippet, we will create a `Series` object by selecting only the `City` column.

In [ ]:
# The below will print out an example of a Series object assigned to the ufo DataFrame object representing the City column
# Each item in the Series object is considered an Index object and can be transformed and referenced in the same 
# ways Series objects can be transformed and referenced from DataFrame objects

# Dot Notation similar to Object attribute retrieval
ufo.City

# OR Bracket Notation or python native array slicing or __getitem__
# ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

## Indexing and Selecting Data

There are a few options on referencing values within a DataFrame all with pros and cons.

### Brackets [ ]
Similar to a python dict data structure, columns can be referenced from a DataFrame object with bracket notation. This is quite useful when the column names contain white space or special characters or when we are unsure if the column exists in the DataFrame. We can use bracket notation to create new Series objects and assign them to existing DataFrame objects as appended columns. Bracket notation is extremely powerful as we can apply slicing and transformations to DataFrame objects just as we can for any other array in python.

In [79]:
# Append a new column to the ufo dataset
# Bracket Notation is used to create a new Series object and associate with the existing ufo DataFrame
ufo['Location'] = ufo['City'] + ', ' + ufo['State']
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [86]:
# Retrieves rows 50 through 60 as a subset of data from the DataFrame ufo
ufo[50:60]

,City,Colors Reported,Shape Reported,State,Time,Location
50,Syracuse,NaN,DISK,NY,2/20/1947 22:15,"Syracuse, NY"
51,Miami,NaN,OTHER,FL,4/15/1947 14:00,"Miami, FL"
52,San Deigo,NaN,TRIANGLE,CA,4/15/1947 23:00,"San Deigo, CA"
53,Minden,NaN,NaN,LA,6/1/1947 0:00,"Minden, LA"
54,Cleveland,NaN,LIGHT,OH,6/1/1947 2:30,"Cleveland, OH"
55,Espanola,NaN,CIRCLE,NM,6/1/1947 17:00,"Espanola, NM"
56,Oroville,NaN,NaN,CA,6/1/1947 18:00,"Oroville, CA"
57,Oakmont,NaN,NaN,PA,6/13/1947 20:18,"Oakmont, PA"
58,Winona,NaN,DISK,MN,6/15/1947 10:00,"Winona, MN"
59,Gackle,NaN,OTHER,ND,6/15/1947 14:00,"Gackle, ND"

In [ ]:
# Reverse the retrieval order of data from the DataFrame ufo
# Notice: the Index values are not changed so a subsequent call of ufo[50:60] will return the same data as before

ufo[::-1]

,City,Colors Reported,Shape Reported,State,Time,Location
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,"Ybor, FL"
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,"Eagle River, WI"
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,"Eagle River, WI"
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,"Spirit Lake, IA"
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,"Grant Park, IL"
...,...,...,...,...,...,...
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"

In [ ]:
# Similar to native python, we can loop through rows of data using array slicing
# [ (starting index inclusive) : (ending index exclusive) : (interation step, default 1 to include every item) ]
ufo[50:60:2]

,City,Colors Reported,Shape Reported,State,Time,Location
50,Syracuse,NaN,DISK,NY,2/20/1947 22:15,"Syracuse, NY"
52,San Deigo,NaN,TRIANGLE,CA,4/15/1947 23:00,"San Deigo, CA"
54,Cleveland,NaN,LIGHT,OH,6/1/1947 2:30,"Cleveland, OH"
56,Oroville,NaN,NaN,CA,6/1/1947 18:00,"Oroville, CA"
58,Winona,NaN,DISK,MN,6/15/1947 10:00,"Winona, MN"

In [ ]:
# Retrieves the City data stored at Index 50. This can be used to retrieve or iterate on data in the dataset
ufo['City'][50]

'Syracuse'

#### Options to set when using Bracket Notation
This powerful tool can become dangerous when attempting to perform `in place` transformations, causing unintended side effects such as [chained assignments](https://pandas.pydata.org/docs/dev/user_guide/copy_on_write.html#copy-on-write-chained-assignment) or writing to [read-only arrays](https://pandas.pydata.org/docs/dev/user_guide/copy_on_write.html#read-only-numpy-arrays). To prevent accidental side effects, it is best practice to set the option in pandas to warn or raise exceptions on chained assignments with `pd.option.mode.chained_assignment = 'warn'` or `pd.option.mode.chained_assignment = 'raise'`. Eventually, `in place` will be deprecated with later versions of pandas (>=3.0). For versions prior, it is recommended to set the `copy on write` option to `True` with `pd.options.mode.copy_on_write = True`.

### Attribute Notation .
DataFrame and Series are both objects and can have the data stored in them referenced as attributes just like any other python object. Using attribute or Dot notation is great when the data only needs to be read or iterated through. With attribute notation, we don't have to worry about side effects since we cannot write back to the objects we access. We are limited to what the columns can be named using Attribute notation. The names of Series objects referenced with attribute notation must be held to the same standards as any other python variable.

In [95]:
ufo = read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')

# Bracket allows us to create a new column and assign it to ufo DataFrame
# Attribute notation allows us to quickly read the values from City and State
ufo['Location'] = ufo.City + ', ' + ufo.State

ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [ ]:
# We can use attribute and bracket notation in tandem for better human readability 
ufo.City[0:5]

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

## Methods and Attributes of Pandas
Methods and Attributes refer to the Functions and Objects associated with the DataFrame class. The DataFrame object must be referenced as part of the call to these functions and objects. In the following code snippets, we will explain the most commonly used methods and attributes of DataFrame.

In [52]:
# Create the DataFrame object to be used for examining Methods and Attributes

movies = read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/imdb_1000.csv')

# head(n=5), function which returns a subset of rows of data from the referenced DataFrame, defaults to 5 rows
# the return value is a view of a DataFrame object which can be set to a new variable as a copy.
# Pandas utilizes Copy-On-Write for dealing with Views and memory optimization.
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [ ]:
movies_info = movies.drop(['actors_list', 'star_rating'], axis=1)

movies_info.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [10]:
# Describe calculates summary statistics
# Takes 3 parameters:
# percentiles = takes an iterable object of numbers whose value should be between 0 and 1
# By default, percentiles will compute 25%, 50% and 75% from an input like [.25, .5, .75]
# include = takes an iterable object of strings describing the dtype of the values to include in the stats
# By default, include is set to 'None' and only takes numerical columns into account
# exclude = takes an iterable object of strings describing the dtype of the values to exclude, None by default
# Numerical stats returned on describe include count, mean, standard deviation, min, max and percentiles.
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [11]:
# the basic stats of the describe method changes based on the included dtypes
# Object stats returned on describe include count, unique, top, freq
movies.describe(include=['object'])

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,The Girl with the Dragon Tattoo,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [12]:
# Shape is an attribute of the DataFrame which returns a Tuple of rows and columns for the dataset
movies.shape

(979, 6)

In [13]:
# DTypes is an attribute of the DataFrame which describes the schema of the dataset
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

## Columnar Transformations

In [34]:
# Rename existing column
ufo = read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')

# check column values
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

### Updating Column Names with DataFrame.rename

With the rename method, we can give a dict parameter to map the previous column names with the intended replacements. Due to Copy on Write functionality, the default action is to create new Series objects with different names and change the associations with the DataFrame object. By setting inplace to True, we can overwrite the existing Series objects instead of keeping them in memory.

### Replacing the Column Names in the DataFrame Object

The rename method is a great option when a few columns need to be renamed. However, if ALL of the column names require some form of transformation, it may be better to transform or replace the array of column names owned by the DataFrame object directly.

In [11]:
# Replaces the priorly changed columns back to having spaces instead of underscores
ufo.columns.str.replace('_', ' ')

ufo.columns

Index(['City', 'colors_reported', 'shape_reported', 'State', 'Time'], dtype='object')

Warning: When replacing the columns array with a hard coded value like below, the length of the array MUST MATCH the existing number of columns owned by the DataFrame. If too many OR too few entries are in the new array of column names a ValueError will be thrown. It is usually preferred to handle in place column name transformations with rename or string manipulation like the previous examples.

In [37]:
# Replaces the existing columns with the new given columns
ufo.columns = ['us_city', 'color', 'appearance', 'us_state', 'event_time']

ufo.head()

                us_city color appearance us_state       event_time
0                Ithaca   NaN   TRIANGLE       NY   6/1/1930 22:00
1           Willingboro   NaN      OTHER       NJ  6/30/1930 20:00
2               Holyoke   NaN       OVAL       CO  2/15/1931 14:00
3               Abilene   NaN       DISK       KS   6/1/1931 13:00
4  New York Worlds Fair   NaN      LIGHT       NY  4/18/1933 19:00

### Removing Columns with DataFrame.drop

The drop method will create a DataFrame based on the referenced DataFrame minus the specified values given as the method parameter. The method can drop either columns or rows. The method parameter, axis, must be a value of '0' if we wish to remove rows or '1' to remove columns. By default, axis is set to 0 to remove rows via indexed number. Drop will return a new DataFrame with the removal transformations applied by default to preserve the reference of the original Series objects.

In [ ]:
ufo.drop(['us_city'], axis=1, inplace=True)

ufo

      color appearance us_state        event_time
0       NaN   TRIANGLE       NY    6/1/1930 22:00
1       NaN      OTHER       NJ   6/30/1930 20:00
2       NaN       OVAL       CO   2/15/1931 14:00
3       NaN       DISK       KS    6/1/1931 13:00
4       NaN      LIGHT       NY   4/18/1933 19:00
...     ...        ...      ...               ...
18236   NaN   TRIANGLE       IL  12/31/2000 23:00
18237   NaN       DISK       IA  12/31/2000 23:00
18238   NaN        NaN       WI  12/31/2000 23:45
18239   RED      LIGHT       WI  12/31/2000 23:45
18240   NaN       OVAL       FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [48]:
temp_column = ufo['us_state']


ufo.drop(['us_state'], axis=1, inplace=True)

print(temp_column.head())

ufo.describe()

0    NY
1    NJ
2    CO
3    KS
4    NY
Name: us_state, dtype: object

        us_city color appearance        event_time
count     18215  2882      15597             18241
unique     6475    27         27             16145
top     Seattle   RED      LIGHT  11/16/1999 19:00
freq        187   780       2803                27

In [51]:
ufo.columns

Index(['us_city', 'color', 'appearance', 'event_time'], dtype='object')